app/views/employees/index.html.erb

    <td><%=  employee.phone.insert(0, '').insert(3, '-').insert(7, '-')  %></td>
    <td><%= employee.assignments.first.store.name %></td>
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ? ORDER BY "assignments"."id" ASC LIMIT ?  [["employee_id", 170], ["LIMIT", 1]]
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]

    <td><%=  employee.phone.insert(0, '').insert(3, '-').insert(7, '-')  %></td>
    <td><%= employee.assignments.first.store.name %></td>
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ? ORDER BY "assignments"."id" ASC LIMIT ?  [["employee_id", 5], ["LIMIT", 1]]
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]