app/views/employees/show.html.erb


  <%= @employees.assignments.first.store.name%>
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ? ORDER BY "assignments"."id" ASC LIMIT ?  [["employee_id", 170], ["LIMIT", 1]]
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]


  <%= link_to @employees.assignments.first.store.name, store_path(@employees.assignments.first.store.id)%>
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ? ORDER BY "assignments"."id" ASC LIMIT ?  [["employee_id", 170], ["LIMIT", 1]]
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]


  Since <%= @employees.assignments.first.start_date.to_formatted_s(:long) %>
---
SELECT  "assignments".* FROM "assignments" WHERE "assignments"."employee_id" = ? ORDER BY "assignments"."id" ASC LIMIT ?  [["employee_id", 170], ["LIMIT", 1]]