app/views/stores/show.html.erb

  <b>Manager(s) </b>
  <% @stores.employees.managers.active.each do |s| %>
---
SELECT "employees".* FROM "employees" INNER JOIN "assignments" ON "employees"."id" = "assignments"."employee_id" WHERE "assignments"."store_id" = ? AND (role = 'manager') AND "employees"."active" = ?  [["store_id", 4], ["active", 1]]

    <tr>
    <% @stores.assignments.current.each do |s| %>
---
SELECT "assignments".* FROM "assignments" WHERE "assignments"."store_id" = ? AND (end_date IS NULL)  [["store_id", 4]]