app/controllers/employees_controller.rb

SELECT  "employees".* FROM "employees" WHERE "employees"."active" = ? AND (role = 'employee') AND "employees"."active" = ? ORDER BY last_name, first_name LIMIT ? OFFSET ?  [["active", 1], ["active", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "employees" WHERE "employees"."active" = ?  [["active", 1]]
---
  def index
        @employees = Employee.active.alphabetical.paginate(:page => params[:page]).per_page(10)

UPDATE "employees" SET "first_name" = ?, "last_name" = ?, "ssn" = ?, "date_of_birth" = ?, "phone" = ? WHERE "employees"."id" = ?
---
  def update
    if @employees.update(employee_params)

DELETE FROM "employees" WHERE "employees"."id" = ?
---
  def destroy
    @employees.destroy

SELECT  "employees".* FROM "employees" WHERE "employees"."id" = ? LIMIT ?  [["id", 170], ["LIMIT", 1]]
---
  def set_employee
        @employees= Employee.find(params[:id])