app/controllers/stores_controller.rb

    def index
        @stores = Store.active.alphabetical.paginate(:page => params[:page]).per_page(10)
---
SELECT  "stores".* FROM "stores" WHERE "stores"."active" = ? AND "stores"."active" != ? ORDER BY name LIMIT ? OFFSET ?  [["active", 1], ["active", 1], ["LIMIT", 10], ["OFFSET", 0]]
SELECT COUNT(*) FROM "stores" WHERE "stores"."active" = ?  [["active", 1]]

def create
    @stores = Store.new(store_params)
    if @stores.save
---
INSERT INTO "stores" ("name", "street", "city", "state", "zip", "phone", "active") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    if @stores.update(store_params)
---
UPDATE "stores" SET "name" = ?, "street" = ?, "city" = ?, "zip" = ?, "phone" = ? WHERE "stores"."id" = ?

  def destroy
    @stores.destroy
---
DELETE FROM "stores" WHERE "stores"."id" = ?

  def set_store
        @stores= Store.find(params[:id])
---
SELECT  "stores".* FROM "stores" WHERE "stores"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]